app/views/home/index.html.erb

@categories ||=Category.find(:all)
@users ||=User.find(:all)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1