app/controllers/categories_controller.rb

  def index
    @categories=Category.all   #.paginate(:per_page => 2, :page => params[:page])
---
SELECT `categories`.* FROM `categories`

  def edit
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

  def create
    @category = Category.new(params[:category])
    if @category.save
---
INSERT INTO `categories` (`level`, `lft`, `updated_at`, `rgt`, `position`, `parent_id`, `description`, `name`, `created_at`) VALUES (NULL, 3, '2011-09-26 11:00:31', 4, '', NULL, 'contains pants , shirts', 'Ladies', '2011-09-26 11:00:31')

  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(params[:category])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `updated_at` = '2011-09-26 10:59:25', `position` = '', `description` = 'contains pants ,T-shirts, formala' WHERE `categories`.`id` = 1