app/controllers/occasions_controller.rb

SELECT `occasions`.* FROM `occasions`
---
  def index
    @occasions=Occasion.all   #.paginate(:per_page => 2, :page => params[:page])

SELECT `occasions`.* FROM `occasions` WHERE `occasions`.`id` = 1 LIMIT 1
---
  def edit
    @occasion = Occasion.find(params[:id])

INSERT INTO `occasions` (`description`, `name`, `created_at`, `updated_at`) VALUES ('We have formal shirts, pants', 'Function', '2011-09-26 12:32:21', '2011-09-26 12:32:21')
---
  def create
    @occasion = Occasion.new(params[:occasion])
    if @occasion.save