app/controllers/products_controller.rb

  def index
    if params[:category_id]
    @category = Category.find(params[:category_id])
    @products=@category.products.paginate(:per_page => 3, :page => params[:page])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `products` INNER JOIN `category_products` ON `products`.id = `category_products`.product_id WHERE ((`category_products`.category_id = 3))
SELECT `products`.* FROM `products` INNER JOIN `category_products` ON `products`.id = `category_products`.product_id WHERE ((`category_products`.category_id = 3)) LIMIT 1 OFFSET 0

def new
  @category = Category.find(params[:category_id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

  def edit
    @category = Category.find(params[:category_id])
    @product = Product.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def show
   # @category = Category.find(params[:category_id])
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def create
    @category = Category.find(params[:category_id])
    @product = Product.new(params[:product])
    @product.size_id=params[:size_id]
    if @product.save
      CategoryProduct.create(:product_id=>@product.id,:category_id=>@category.id)
      if params[:product][:image] != ""
      file=params[:product][:image]
      destination_path = "#{RAILS_ROOT}/public/images/"
      status = Product.save_image(params[:product][:image],destination_path,"images")
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
INSERT INTO `products` (`price`, `updated_at`, `size`, `name`, `description`, `created_at`, `occasion_id`, `size_id`) VALUES (300, '2011-09-26 10:02:39', 'medium', 'Levis', 'Levis is good product', '2011-09-26 10:02:39', NULL, 1)
INSERT INTO `category_products` (`category_id`, `updated_at`, `product_id`, `created_at`) VALUES (113193, '2011-09-27 04:46:55', 4, '2011-09-27 04:46:55')
INSERT INTO `images` (`product_id`, `name`, `image_path`, `updated_at`, `created_at`) VALUES (10, 'Sunset Tree 5433', '/images/Sunset Tree 5433.jpg', '2011-09-27 14:02:08', '2011-09-27 14:02:08')

  def update
    @category = Category.find(params[:category_id])
    @product = Product.find(params[:id])
    @product.size_id=params[:size_id]
    if params[:product][:image] != ""
      file=params[:product][:image]
      destination_path = "#{RAILS_ROOT}/public/images/"
      status = Product.save_image(params[:product][:image],destination_path,"images")
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `images` (`updated_at`, `name`, `product_id`, `image_path`, `created_at`) VALUES ('2011-09-28 07:23:28', 'made_in_usa-300x218', 10, '/images/made_in_usa-300x218.gif', '2011-09-28 07:23:28')
UPDATE `products` SET `name` = 'Levis pant', `updated_at` = '2011-09-26 13:26:43', `price` = 500 WHERE `products`.`id` = 1