app/controllers/sizes_controller.rb

  def index
   # @category = Category.find(params[:category_id])
    @product =Product.find(params[:product_id])
    @sizes=Size.all.paginate(:per_page => 2, :page => params[:page])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `sizes`.* FROM `sizes`

  def edit
    @product =Product.find(params[:product_id])
    @size = Size.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 1 LIMIT 1

  def show
    @product =Product.find(params[:product_id])
    @size = Size.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 1 LIMIT 1

  def create
    @product =Product.find(params[:product_id])
    @size = Size.new(params[:size])
    if @size.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `sizes` (`updated_at`, `created_at`, `name`) VALUES ('2011-09-26 12:09:38', '2011-09-26 12:09:38', 'xx')

  def update
    @product =Product.find(params[:product_id])
    @size = Size.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 1 LIMIT 1