app/views/products/_form.html.erb

SELECT `sizes`.* FROM `sizes`
---
    <%#= f.text_field :size %>
	<%=select_tag "size_id", options_from_collection_for_select(@size=Size.all, "id", "name"), :prompt => "Select something"%>