app/views/products/_list.html.erb

    <td><%= product.name %></td>
	<td ><%size=Size.find(product.size_id)%><%=size.name%></td>
---
SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 1 LIMIT 1