app/views/products/index.html.erb

SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 3 LIMIT 1
---
    <td><%=link_to product.name,{:controller =>"products",:action =>"edit",:id =>product.id} %></td>
	<td ><%size=Size.find(product.size_id)%><%=size.name%></td>