app/views/products/show.html.erb

  <b>Size:</b>
  <%size=Size.find(@product.size_id)%><%=size.name%>
---
SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 1 LIMIT 1